import type { Meta, StoryObj } from "@storybook/react";
import BenefitCard from "./benefitCard";

const meta = {
	component: BenefitCard,
	title: "Features/BenefitCard",
	tags: ["autodocs"],
	parameters: {
		layout: "centered",
	},
} satisfies Meta<typeof BenefitCard>;

type Story = StoryObj<typeof BenefitCard>;

export const BenefitCardSimple: Story = {
	args: {
		icon: (
			<svg
				width="48"
				height="48"
				viewBox="0 0 48 48"
				fill="none"
				xmlns="http://www.w3.org/2000/svg"
			>
				<rect
					x="0.5"
					y="0.5"
					width="47"
					height="47"
					rx="9.5"
					stroke="white"
				/>
				<path
					d="M31.4344 29V19H36.4114C37.1017 19 37.7057 19.2786 38.2234 19.8358C38.7411 20.393 
				39 21.0431 39 21.786V22.4993C39 23.0688 38.8493 23.5951 38.5479 24.078C38.2453 24.5597 37.7897 
				24.9243 37.1811 25.172L38.7342 29H37.1414L35.5882 25.2853H32.96V29H31.4344ZM32.96 23.6434H36.4114C36.6772 
				23.6434 36.9205 23.5245 37.1414 23.2868C37.3634 23.0478 37.4745 22.7853 37.4745 22.4993V21.786C37.4745 
				21.5 37.3634 21.2381 37.1414 21.0004C36.9205 20.7614 36.6772 20.6419 36.4114 20.6419H32.96V23.6434ZM9 
				29V19H10.5255V22.7147H15.04V19H16.5656V29H15.04V24.3566H10.5255V29H9ZM20.2172 29V19H25.1942C25.8845 19 
				26.4885 19.2786 27.0062 19.8358C27.5239 20.393 27.7828 21.0431 27.7828 21.786V26.214C27.7828 26.9569 
				27.5239 27.607 27.0062 28.1642C26.4885 28.7214 25.8845 29 25.1942 29H20.2172ZM21.7428 27.3581H25.1942C25.46 
				27.3581 25.7039 27.2392 25.9259 27.0015C26.1468 26.7625 26.2572 26.5 26.2572 26.214V21.786C26.2572 21.5 
				26.1468 21.2381 25.9259 21.0004C25.7039 20.7614 25.46 20.6419 25.1942 20.6419H21.7428V27.3581Z"
					fill="white"
				/>
			</svg>
		),
		title: "Высокое качество",
		description:
			"Наше AR приложение отличается высоким качеством визуализации, обеспечивая реалистичное отображение виртуальных объектов",
	},
};

export default meta;
